import Head from "next/head";
import Navbar from "../components/Navbar";
import Footer from "../components/Footer";
import { useState } from "react";
import styles from "../styles/Services.module.css";

const policies = [
  {
    title: "Πολιτική Ποιότητας",
    shortDescription:
      "Η εταιρεία VTGS IKE δραστηριοποιείται στο αντικείμενο της Διαχείρισης Ανθρώπινου Δυναμικού για το Δημόσιο και της Διοργάνωσης Πολιτιστικών, Κοινωνικών και Αθλητικών Δραστηριοτήτων...",
    fullDescription: `Η εταιρεία VTGS IKE δραστηριοποιείται στο αντικείμενο της Διαχείρισης Ανθρώπινου Δυναμικού για το Δημόσιο και της Διοργάνωσης Πολιτιστικών, Κοινωνικών και Αθλητικών Δραστηριοτήτων.
    Βασική αρχή και δέσμευση αλλά και φιλοσοφία κάθε στελέχους της είναι να παρέχει στους πελάτες της υπηρεσίες υψηλής ποιότητας και προστιθέμενης αξίας που συμμορφώνονται πλήρως με τις δεδηλωμένες απαιτήσεις τους, με τις προδιαγραφές που τίθενται για κάθε σύμβαση έργου, καθώς και με τις κανονιστικές και νομικές απαιτήσεις.
    Το όραμα της εταιρείας για το μέλλον είναι η διατήρηση του υψηλού επιπέδου παρεχόμενων υπηρεσιών που έχει ως αποτέλεσμα την αμέριστη υποστήριξη των πελατών με τους οποίους συνεργάζεται, η αύξηση των πωλήσεων και η βελτίωση της ταχύτητας εξυπηρέτησης των πελατών της.
    Για να επιτύχει τα ανωτέρω, η Διοίκηση της εταιρείας:
    Έχει υιοθετήσει Σύστημα Διαχείρισης της Ποιότητας σύμφωνα με το Διεθνές Πρότυπο ISO 9001:2015 το οποίο και εφαρμόζει σε ολόκληρη την εταιρία και σε όλες τις δραστηριότητες που έχουν επίπτωση στην ποιότητα των υπηρεσιών της, καθώς και για την ικανοποίηση των πελατών της.
    Ανασκοπεί και βελτιώνει συνεχώς τα χαρακτηριστικά των υπηρεσιών της, όπου είναι εφικτό, καθώς και την αποτελεσματικότητα των Διεργασιών της και κατ’ επέκταση ολόκληρου του Συστήματος Διαχείρισης Ποιότητας (ΣΔΠ).
    Θέτει μετρήσιμους αντικειμενικούς στόχους για την ποιότητα σε εταιρικό και λειτουργικό επίπεδο. Οι στόχοι αυτοί καθιερώνονται και αξιολογούνται ως προς τον βαθμό επίτευξής τους στα πλαίσια της Ανασκόπησης του ΣΔΠ από την Ανώτατη Διοίκηση της εταιρίας και στο τέλος κάθε έργου, αντίστοιχα.
    Προσδιορίζει τα ενδιαφερόμενα μέρη που επηρεάζονται από την δραστηριότητά της και προσδιορίζει τις ανάγκες και προσδοκίες τους.
    Αναγνωρίζει και αξιολογεί τους κινδύνους που σχετίζονται με την λειτουργία της, εντοπίζει τις πιθανές καταστάσεις που δύναται να αποτελέσουν εμπόδιο στην επίτευξη των στόχων της και λαμβάνει μέτρα διαχείρισης.
    Παρέχει τους απαραίτητους πόρους για την απρόσκοπτη, αποδοτική και αποτελεσματική λειτουργία κάθε Τμήματος της εταιρίας.
    Επενδύει στην συνεχή κατάρτιση, ενημέρωση και εκπαίδευση των στελεχών της ώστε να παράγουν την Ποιότητα σε κάθε δραστηριότητα τους.
    Παρακολουθεί, μετράει, αξιολογεί τις κρίσιμες παραμέτρους και Διεργασίες, ώστε να διασφαλίζεται η Ποιότητα.
    Υιοθετώντας την αρχή της συνεχούς βελτίωσής της, η VTGS IKE αναγνωρίζει και ανταμείβει την ομαδική εργασία και την ατομική προσπάθεια, επενδύει στον Άνθρωπο και σέβεται τον Πελάτη.`,
  },
  {
    title: "Περιβαλλοντική Πολιτική",
    shortDescription:
      "Η εταιρεία VTGS IKE δεσμεύεται για την ικανοποίηση των απαιτήσεων των πελατών της με ταυτόχρονη προώθηση της αειφόρου ανάπτυξης μέσω της ορθότερης διαχείρισης των φυσικών πόρων...",
    fullDescription: `Η εταιρεία VTGS IKE δραστηριοποιείται στο αντικείμενο της Διαχείρισης Ανθρώπινου Δυναμικού για το Δημόσιο και της Διοργάνωσης Πολιτιστικών, Κοινωνικών και Αθλητικών Δραστηριοτήτων.
    Λαμβάνοντας υπόψη την ολοένα αυξανόμενη σημασία της προστασίας του περιβάλλοντος, δεσμεύεται για την ικανοποίηση των απαιτήσεων των πελατών της με ταυτόχρονη προώθηση της αειφόρου ανάπτυξης μέσω της ορθότερης διαχείρισης των φυσικών της πόρων, τη μείωση των περιβαλλοντικών επιπτώσεων και το συνεχή περιβαλλοντικό έλεγχο των δραστηριοτήτων της.
    Η εταιρία δεσμεύεται στο πλαίσιο μιας γενικότερης φιλοσοφίας περιβαλλοντικής προστασίας για την υλοποίηση δράσεων που έχουν τους εξής κύριους άξονες εφαρμογής:
    Εφαρμογή ενός Συστήματος Περιβαλλοντικής Διαχείρισης σύμφωνα με το διεθνές πρότυπο ISO 14001:2015, με σκοπό τη συνεχή βελτίωση των περιβαλλοντικών επιδόσεων της εταιρίας.
    Ικανοποίηση απαιτήσεων συμμόρφωσης των δραστηριοτήτων της εταιρίας με τις ισχύουσες εθνικές και κοινοτικές νομοθεσίες και κανονιστικές διατάξεις.
    Ορθολογικότερη χρήση φυσικών πόρων, ενέργειας, πρώτων και βοηθητικών υλών στις παραγωγικές διαδικασίες, με ταυτόχρονη διατήρηση της ποιότητας του παραγόμενου προϊόντος ή υπηρεσίας.
    Μείωση, με απώτερο σκοπό την ελαχιστοποίηση όπου αυτό είναι εφικτό, της παραγωγής υγρών, στερεών ή αερίων αποβλήτων.
    Ανάλυση των περιβαλλοντικών επιπτώσεων πριν από την υιοθέτηση και εισαγωγή νέων παραγωγικών διαδικασιών και προϊόντων.
    Συνεχής ενημέρωση, εκπαίδευση και ενθάρρυνση όλου του προσωπικού για την ενεργό συμμετοχή τους στη βελτίωση των περιβαλλοντικών επιδόσεων.
    Πληροφόρηση των συνεργατών της εταιρίας (πελάτες, προμηθευτές, υπεργολάβους, κυβερνητικούς φορείς κλπ) για τα τη δέσμευση της εταιρίας με σκοπό την μείωση των περιβαλλοντικών επιπτώσεών της.
    Παροχή πληροφοριών σε εξωτερικούς φορείς σχετικά με τις περιβαλλοντικές επιδόσεις με σκοπό την ενημέρωση και συνεργασία για την ευρύτερη προστασία του περιβάλλοντος.
    Εισαγωγή περιβαλλοντικών προγραμμάτων με στόχο την επίτευξη αντικειμενικών περιβαλλοντικών στόχων, τη μείωση των περιβαλλοντικών κινδύνων και την πρόληψη περιβαλλοντικών ατυχημάτων.
    Συστηματική μέτρηση, αξιολόγηση και παρακολούθηση κατά την εφαρμογή των αρχών της περιβαλλοντικής πολιτικής.
    Συνεχή ανασκόπηση των περιβαλλοντικών προγραμμάτων και στόχων που έχουν τεθεί από την εταιρία με σκοπό τη συνεχή βελτίωση των περιβαλλοντικών επιδόσεων και τη δημιουργία ευνοϊκών συνθηκών αειφόρου ανάπτυξης.`,
  },
  {
    title: "Πολιτική για την Υγεία και Ασφάλεια",
    shortDescription:
      "Η εταιρεία VTGS IKE δραστηριοποιείται στο αντικείμενο της Διαχείρισης Ανθρώπινου Δυναμικού για το Δημόσιο και της Διοργάνωσης Πολιτιστικών, Κοινωνικών και Αθλητικών Δραστηριοτήτων...",
    fullDescription: `Η εταιρεία VTGS IKE δραστηριοποιείται στο αντικείμενο της Διαχείρισης Ανθρώπινου
Δυναμικού για το Δημόσιο και της Διοργάνωσης Πολιτιστικών, Κοινωνικών και Αθλητικών
Δραστηριοτήτων.
Η επαγγελματική υγεία και ασφάλεια ορίζεται από την VTGS IKE ως η διασφάλιση της
ευεξίας των εργαζομένων, αλλά και οποιουδήποτε άλλου προσώπου σε χώρους που
εκτελούνται εργασίες της εταιρείας. Αυτό επιτυγχάνεται μέσω:
 της αναγνώρισης και εκτίμησης όλων των πιθανών κινδύνων που απορρέουν τόσο
από την εκτέλεση των εργασιών (τακτικών και μη), όσο και από οποιαδήποτε άλλη
δραστηριότητα του προσωπικού, το οποίο έχει πρόσβαση στο χώρο εργασίας
(συμπεριλαμβανομένων και των υπεργολάβων και των επισκεπτών).
 της προσπάθειας ελαχιστοποίησης της πιθανότητας εμφάνισης ενός κινδύνου αλλά
και της επίπτωσής του, σε περίπτωση που δεν είναι δυνατό να αποφευχθεί, με την
εφαρμογή κατάλληλων διαδικασιών και μέτρων πρόληψης και καταστολής.
 της συμμόρφωσης με το σύνολο της εφαρμοζόμενης νομοθεσίας και της εφαρμογής
προγραμμάτων και διαδικασιών για την διασφάλιση αυτής της συμμόρφωσης.
 της εκτίμησης και μέτρησης της επικινδυνότητας σε τακτά χρονικά διαστήματα και
ειδικότερα μετά από την εφαρμογή διορθωτικών ενεργειών, με στόχο τη εξασφάλιση
της συνεχούς μείωσής της.
 της παροχής όλων των απαιτούμενων πόρων (εκπαίδευση προσωπικού, μέσα
ατομικής προστασίας, μέσα πυροπροστασίας) για τη διαφύλαξη της ασφάλειας και
της υγείας των εργαζομένων.
 της συμμετοχής και διαβούλευσης των εργαζομένων για θέματα υγείας και ασφάλειας
στην εργασία.
 Της δέσμευσης της Διοίκησης της VTGS IKE να παρακολουθεί και να μετρά συνεχώς
την επίδοσή της όσον αφορά τα θέματα υγείας και ασφάλειας και να στοχεύει στη
διαρκή βελτίωση της επίδοσής της.

Για την επίτευξη των παραπάνω, η εταιρεία εφαρμόζει Σύστημα Διαχείρισης της Υγείας
και Ασφάλειας στην Εργασία, σύμφωνα με τις απαιτήσεις του Προτύπου ISO 45001:2018
και της ισχύουσας νομοθεσίας.
Η ευαισθησία της Διοίκησης της VTGS IKE στα θέματα που αφορούν την Υγεία και
Ασφάλεια στην Εργασία, καθώς και η ολοένα αυξανόμενη συνείδηση και ευαισθητοποίηση
του προσωπικού της αλλά και των ενδιαφερόμενων μερών (πελατών, προμηθευτών,
υπεργολάβων, κλπ) αποτελεί αδιαμφισβήτητο πλεονέκτημά της για την επίτευξη των
αντικειμενικών σκοπών της Διοίκησης για την Υγεία και Ασφάλεια στην Εργασία.`,
  },
];

export default function Services() {
  const [expanded, setExpanded] = useState({});

  const toggleExpand = (index) => {
    setExpanded({ ...expanded, [index]: !expanded[index] });
  };

  return (
    <div className={styles.container}>
      <Head>
        <title>VTGS - Services</title>
        <meta
          name="description"
          content="Detailed description of the services offered by VTGS."
        />
        <link rel="icon" href="/favicon.ico" />
      </Head>

      <Navbar />

      <main className={styles.main}>
        <h1>Οι Πολιτικές και οι Υπηρεσίες μας</h1>

        <div className={styles.cardContainer}>
          {policies.map((policy, index) => (
            <div className={styles.card} key={index}>
              <h3>{policy.title}</h3>
              <p>
                {expanded[index]
                  ? policy.fullDescription
                  : policy.shortDescription}
              </p>
              <button onClick={() => toggleExpand(index)}>
                {expanded[index] ? "Διαβάστε Λιγότερα" : "Διαβάστε Περισσότερα"}
              </button>
            </div>
          ))}
        </div>
      </main>

      <Footer />
    </div>
  );
}
